---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UnableToMakeConnectionInDirection
source: html/3b3a2c2f-32ff-92ee-68d8-41f98e35e0de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UnableToMakeConnectionInDirection Property

The application is unable to make a connection in that direction. If the connectors are pointing up, make sure that the elevations of the segments (ducts and pipes) are above them. If the connectors are pointing down, make sure that the elevations of the segments (ducts and pipes) are below them.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToMakeConnectionInDirection { get; }
```